w6d3/app/controllers/collections_controller.rb

    def index
        collections = Collection.where(user_id: collection_params[:user_id])
        unless collections.empty?
            render json: collections
        else
            render plain: 'No collections were matched'
        end
    rescue
        render json: Collection.all
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 2]]
SELECT  1 AS one FROM "collections" WHERE "collections"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "collections".* FROM "collections"