w6d3/app/controllers/comments_controller.rb

    def index
        if comment_params[:author_id]
            comments = Comment.where(author_id: comment_params[:author_id])
        else
            comments = Comment.where(artwork_id: comment_params[:artwork_id])
        end
        unless comments.empty?
---
SELECT  "comments".* FROM "comments" WHERE "comments"."author_id" = $1 LIMIT $2  [["author_id", 9], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 1], ["LIMIT", 1]]