w6d3/app/controllers/likes_controller.rb

    def index
        if like_params[:user_id]
            likes = Like.where(user_id: like_params[:user_id])
            unless likes.empty?
                render json: likes
            else
                render plain: 'No likes were matched'
            end
        elsif like_params[:likeable_id] && like_params[:likeable_type]
            likes = Like.where(likeable_id: like_params[:likeable_id], likeable_type: like_params[:likeable_type])
            unless likes.empty?
                render json: likes
            else
                render plain: 'No likes were matched'
            end
        end
    rescue
        render json: Like.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 1]]
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2  [["likeable_id", 1], ["likeable_type", "Artwork"]]
SELECT  1 AS one FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2 LIMIT $3  [["likeable_id", 1], ["likeable_type", "Artwork"], ["LIMIT", 1]]
SELECT "likes".* FROM "likes"