w6d3/app/controllers/users_controller.rb

    def index
        #add search here
        # params[:query]
        if user_params.has_key?(:username)
            # can modify query w/ regex
            users = User.where('username LIKE (?)', user_params[:username])
            unless users.empty?
                render json: users
            else
                render plain: 'Invalid username'
            end
        end
    rescue
        #render plain: 'Invalid username'
        render json: User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE ('Wakka'))
SELECT  1 AS one FROM "users" WHERE (username LIKE ('Wak')) LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users"

    def update
        user = User.find(params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "'Ike'"], ["updated_at", "2020-07-08 21:52:50.502278"], ["id", 1]]

    def favorite
        user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]